Repository: KDE/kdev-php
Catalog: po/*/kdevphp.po
Languages: ar

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com

source: Override
ar: تجاوز

source: Implement
ar: نفّذ

source: From %1
ar: من %1

# @title:tab
source: PHP Documentation
ar: وثائق PHP

# @title:tab
source: Configure PHP Documentation Settings
ar: اضبط إعدادات وثائق PHP

source: PHP Manual Integration
ar: تكامل دليل PHP

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">By default the online <a href="https://php.net"><span style=" text-decoration: underline; color:#0000ff;">PHP documentation</span></a> is used remotely. Alternatively you can set the location to a local copy of the documentation in the language of your choice. Make sure you downloaded the <span style=" font-style:italic;">"Many HTML files"</span> package.</p></body></html>
ar: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">مبدئيا، الوثائق <a href="https://php.net"><span style=" text-decoration: underline; color:#0000ff;">وثائق PHP</span></a> الشبكية تستخدم عن بعد. بدلا من ذلك، اضبط الموقع لنسخة محلية من الوثائق باللغة التي تختارها. تأكد من تنزيل حزمة <span style=" font-style:italic;">"ملفات HTML عديدة"</span>.</p></body></html>

source: Location:
ar: الموقع:

source: <lost declaration>
ar: <تصريح ضائع>

source: PHP Documentation
ar: وثائق PHP

source: Specifies the location of the PHP documentation to use.
ar: يحدد موقع وثائق PHP المراد استخدامها.

source: The location of the PHP documentation to use. You can either use a remote location like https://php.net or a local directory which contains the PHP documentation in HTML format with many files.
ar: موقع وثائق PHP المراد استخدامها. إما أن تستخدم موقعا بعيدا مثل https://php.net أو دليلا محليا يحتوي على وثائق PHP بتنسيق HTML مع ملفات عديدة.

source: Make sure local copies are downloaded in HTML format with many files.
ar: تأكد من تنزيل النسخ المحلية بتنسيق HTML مع ملفات عديدة.

source: ...loading documentation...
ar: ...يحمّل الوثائق...

source: Circular inheritance of %1 and %2
ar: وراثة دائرية لـ %1 و %2

source: Cannot use '%1' as class name as it is reserved
ar: لا يمكن استخدام '%1' كاسم صنف لأنه محجوز

source: Access type for interface method %1 must be omitted.
ar: يجب حذف نوع الوصول لتابِع الواجهة %1.

source: Interface function %1 cannot contain body.
ar: لا يمكن أن تحتوي دالة الواجهة %1 على جسم.

source: Class %1 contains abstract method %2 and must therefore be declared abstract or implement the method.
ar: يحتوي الصنف %1 على التابع المجرد %2 ولذلك يجب الإعلان عنه كمجرد أو تنفيذ التابع.

source: Abstract function %1 cannot contain body.
ar: لا يمكن أن تحتوي الدالة المجردة %1 على جسم.

source: Cannot use the final modifier on an abstract class member.
ar: لا يمكن استخدام المعدل final على عضو صنف مجرد.

source: Non-abstract method %1 must contain body.
ar: يجب أن يحتوي التابع غير المجرد %1 على جسم.

source: Cannot use 'final' as constant modifier
ar: لا يمكن استخدام 'final' كمعدل ثابت

source: Cannot use 'static' as constant modifier
ar: لا يمكن استخدام 'static' كمعدل ثابت

source: Cannot use 'abstract' as constant modifier
ar: لا يمكن استخدام 'abstract' كمعدل ثابت

source: Properties cannot be declared final.
ar: لا يمكن الإعلان عن الخصائص كـ final.

source: Properties cannot be declared abstract.
ar: لا يمكن الإعلان عن الخصائص كـ abstract.

source: Trait method %1 has not been applied, because there are collisions with other trait methods on %2
ar: لم يطبق تابع السمة %1، لوجود تعارضات مع توابع سمة أخرى على %2

source: Traits cannot have constants.
ar: لا يمكن أن تحتوي السمات على ثوابت.

source: A class constant must not be called 'class'; it is reserved for class name fetching
ar: لا يجب أن يسمى ثابت الصنف 'class'؛ إنه محجوز لجلب اسم الصنف

source: Cannot use 'abstract' as method modifier
ar: لا يمكن استخدام 'abstract' كمعدل تابع

source: Cannot use 'final' as method modifier
ar: لا يمكن استخدام 'final' كمعدل تابع

source: Cannot use 'static' as method modifier
ar: لا يمكن استخدام 'static' كمعدل تابع

source: Variadic parameter cannot have a default value
ar: لا يمكن أن يحتوي الوسيط المتغير على قيمة مبدئية

source: Default value for parameters with a class type hint can only be NULL.
ar: القيمة المبدئية للوسائط ذات تلميح نوع الصنف لا يمكن أن تكون إلا NULL.

source: Only the last parameter can be variadic.
ar: الوسيط الأخير فقط يمكن أن يكون متغيرًا.

source: Cannot redeclare PHP internal %1.
ar: لا يمكن إعادة الإعلان عن PHP الداخلي %1.

source: %1 and %2 define the same property (%3) in the composition of %1. This might be incompatible, to improve maintainability consider using accessor methods in traits instead.
ar: يعرّف %1 و %2 نفس الخاصية (%3) في تكوين %1. قد يكون هذا غير متوافق، لتحسين قابلية الصيانة، فكر في استخدام توابع الوصول في السمات بدلاً من ذلك.

source: Cannot redeclare %1, already declared in %2 on line %3.
ar: لا يمكن إعادة الإعلان عن %1، أُعلن عنه بالفعل في %2 في السطر %3.

source: Class %1 contains %2 abstract methods and must therefore be declared abstract or implement the remaining methods.
ar: يحتوي الصنف %1 على %2 تابع مجرد ولذلك يجب الإعلان عنه كمجرد أو تنفيذ التوابع المتبقية.

source: Cannot re-assign $this.
ar: لا يمكن إعادة تعيين $this.

source: Cannot access private property %1
ar: لا يمكن الوصول إلى الخاصية الخاصة %1

source: Cannot access protected property %1
ar: لا يمكن الوصول إلى الخاصية المحمية %1

source: Cannot use positional argument after argument unpacking
ar: لا يمكن استخدام وسيط موضعي بعد تفريغ الوسيط

source: The use statement with non-compound name '%1' has no effect.
ar: عبارة الاستخدام بالاسم غير المركب '%1' لا أثر لها.

source: Cannot use '%1' as '%2' because the name is already in use.
ar: لا يمكن استخدام '%1' كـ '%2' لأن الاسم قيد الاستخدام بالفعل.

source: Cannot use %1 as %2 because '%2' is a special class name
ar: لا يمكن استخدام %1 كـ %2 لأن '%2' هو اسم صنف خاص

source: The 'yield' expression can only be used inside a function
ar: لا يمكن استخدام تعبير 'yield' إلا داخل دالة

source: Default value for parameters with an object type can only be NULL.
ar: القيمة المبدئية للوسائط ذات نوع الكائن لا يمكن أن تكون إلا NULL.

source: Usage of %1 is deprecated.
ar: استخدام %1 مهمل.

source: Declaration not found: %1
ar: لم يعثر على التصريح: %1

source: Lost trait alias %1
ar: السمة المستعارة المفقودة %1

source: Use of %1 from %2<br />
ar: استخدام %1 من %2<br />

source: Broken member alias trait.
ar: سمة عضو مستعار مكسورة.

source: PHP internal
ar: PHP داخلي

# kind of a php-constant, as shown in the declaration tooltip
source: Constant
ar: ثابت

source: magic constant
ar: ثابت سحري

source: empty (not inside a class)
ar: فارغ (ليس داخل صنف)

source: empty (not inside a trait)
ar: فارغ (ليس داخل سمة)

source: empty (not inside a method)
ar: فارغ (ليس داخل تابع)

source: empty (not inside a function)
ar: فارغ (ليس داخل دالة)

source: empty (not inside a namespace)
ar: فارغ (ليس داخل نطاق أسماء)

source: current value: %1
ar: القيمة الحالية: %1

# as in list of int, set of string
source: %1 of %2
ar: %1 من %2

source: php-parser
ar: محلل php

source: KDevelop PHP parser debugging utility
ar: أداة تصحيح محلل PHP لـ KDevelop

source: (c) 2008 Niko Sams, 2009 Milian Wolff
ar: (ج) 2008 نيكو سامس، 2009 ميليان وولف

source: Could not open file '%1'
ar: لا يمكن فتح الملف '%1'

source: File could not be read from.
ar: لا يمكن القراءة من الملف.

source: File could not be opened.
ar: لا يمكن فتح الملف.

source: File permissions prevent opening for read.
ar: أذونات الملف تمنع فتحه للقراءة.

source: PHPUnit
ar: وحدة PHP
